РП/src/ChartsOfCharacteristicTypes/СтатьиРасходов/СтатьиРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиРасходов</name>
  <type>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>CatalogRef.МаркетинговыеМероприятия</types>
    <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СтатьиКалькуляции</types>
    <types>DocumentRef.ЗаказПоставщику</types>
    <types>DocumentRef.ЗаказНаПроизводство</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>DocumentRef.ВводОстатков</types>
    <types>EnumRef.АналитикаКурсовыхРазниц</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>DocumentRef.ЗаказНаСборку</types>
    <types>CatalogRef.ПретензииКлиентов</types>
    <types>DocumentRef.РеализацияТоваровУслуг</types>
    <types>EnumRef.ВидыОперацийПоЗарплате</types>
    <types>CatalogRef.Партнеры</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>DocumentRef.АктВыполненныхРабот</types>
    <types>DocumentRef.ЗаказНаПеремещение</types>
    <types>CatalogRef.УдалитьДоговорыЭквайринга</types>
    <types>DocumentRef.СборкаТоваров</types>
    <types>CatalogRef.СделкиСКлиентами</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.Кассы</types>
    <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>DocumentRef.ЗаказКлиента</types>
    <types>CatalogRef.Проекты</types>
    <types>EnumRef.ВидыОбязательногоСтрахованияСотрудников</types>
    <types>DocumentRef.ЗаказДавальца</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПрочиеРасходы</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АмортизацияВременнойРазницы2020</name>
      <description>Амортизация временной разницы, возникшей по результатам инвентаризации ОФ в 2020 г.</description>
      <code>УТ-000015</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ЗатратыПриПокупкеИПродажеИностраннойВалюты</name>
      <description>Затраты при покупке и продаже иностранной валюты</description>
      <code>УТ-000011</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницыНеоперационные</name>
      <description>Курсовые разницы (неоперационная деятельность)</description>
      <code>УТ-000012</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Курсовые разницы (операционная деятельность)</description>
      <code>УТ-000003</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>НачисленныйНДСПриВыкупеМногооборотнойТары</name>
      <description>Начисленный НДС при выкупе многооборотной тары</description>
      <code>УТ-000005</code>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СтатьиКалькуляции</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>CatalogRef.ПретензииКлиентов</types>
        <types>CatalogRef.Партнеры</types>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>CatalogRef.СделкиСКлиентами</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>ОкруглениеНаличныхПриРозничныхПродажах</name>
      <description>Округление наличных при розничных продажах</description>
      <code>УТ-000016</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ПогрешностьРасчетаСебестоимости</name>
      <description>Погрешность расчета себестоимости</description>
      <code>УТ-000002</code>
      <type>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.СделкиСКлиентами</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров</name>
      <description>Разницы стоимости возврата и фактической стоимости товаров</description>
      <code>УТ-000004</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>РаспределениеНачальныхОстатковНЗП</name>
      <description>Распределение начальных остатков НЗП</description>
      <code>УТ-000014</code>
      <type>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>РасходыПриПерерасчетеПропорциональногоНДС</name>
      <description>Расходы при перерасчете пропорционального НДС</description>
      <code>УТ-000013</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>СебестоимостьПродаж</name>
      <description>Себестоимость продаж</description>
      <code>УТ-000001</code>
      <type>
        <types>CatalogRef.МаркетинговыеМероприятия</types>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>CatalogRef.СделкиСКлиентами</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>ФормированиеРезервовПоСомнительнымДолгам</name>
      <description>Формирование резервов по сомнительным долгам</description>
      <code>УТ-000008</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ВариантРаспределенияРасходов</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияНаСебестоимость</name>
    <type>
      <types>EnumRef.ПравилаРаспределенияНаСебестоимостьТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияПоНаправлениямДеятельности</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияПоНаправлениямДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияПоЭтапамПроизводства</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияПоПодразделениям</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКредитовИДепозитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаОбъектыЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаНМАиНИОКР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЗаполнениеАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовЗаказРеализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияНаПроизводственныеЗатраты</name>
    <type>
      <types>EnumRef.СпособыРаспределенияСтатейРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыНаРемонтОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета8Класс</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьРеализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

РП/src/Enums/ВариантыРаспределенияРасходов/ВариантыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРаспределенияРасходов</name>
  <enumValues>
    <name>НаСебестоимостьТоваров</name>
  </enumValues>
  <enumValues>
    <name>НаНаправленияДеятельности</name>
  </enumValues>
  <enumValues>
    <name>НаРасходыБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводственныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>НаПрочиеАктивы</name>
  </enumValues>
  <enumValues>
    <name>НеРаспределять</name>
  </enumValues>
  <enumValues>
    <name>НаВнеоборотныеАктивы</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СпособыРаспределенияСтатейРасходов/СпособыРаспределенияСтатейРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРаспределенияСтатейРасходов</name>
  <enumValues>
    <name>ПоПоказателюНаВсеПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоПоказателюНаУказанныеПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоПоказателюНаНижестоящиеПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоПоказателюНаВышестоящееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПоПравилуПоВсемПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамВручнуюПоВсемПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениямИЭтапамПоПравилам</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениямВручнуюПоЭтапамПоПравилу</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПоПравилуВДанномПодразделении</name>
  </enumValues>
  <enumValues>
    <name>НаДругиеСтатьиРасходов</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
</mdclass:Enum>

РП/src/ChartsOfCharacteristicTypes/СтатьиРасходов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	 И ДанныеЗаполнения.Свойство("ВариантРаспределенияРасходов") Тогда
	 
		Если ДанныеЗаполнения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров Тогда
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Склады");
		//++ НЕ УТ
		ИначеЕсли ДанныеЗаполнения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты Тогда
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
		//-- НЕ УТ
		ИначеЕсли ДанныеЗаполнения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы Тогда
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ПрочиеРасходы");
			
		//++ НЕ УТ
		ИначеЕсли ДанныеЗаполнения.ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы Тогда
			
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОбъектыЭксплуатации");
			КонтролироватьЗаполнениеАналитики = Истина;
		//-- НЕ УТ
		КонецЕсли;
	 
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДоговорыКредитовИДепозитов") Тогда
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКредитовИДепозитов");
	КонецЕсли;
	
	Если ТипЗначения.Типы().Количество() > 1 Тогда
		ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Склады");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		
		ПроверяемыеСтатьи = Новый Массив;
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.КурсовыеРазницыНеоперационные);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.НачисленныйНДСПриВыкупеМногооборотнойТары);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.СебестоимостьПродаж);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.ФормированиеРезервовПоСомнительнымДолгам);
		ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.ЗатратыПриПокупкеИПродажеИностраннойВалюты);
        ПроверяемыеСтатьи.Добавить(ПланыВидовХарактеристик.СтатьиРасходов.РасходыПриПерерасчетеПропорциональногоНДС);
		Если ПроверяемыеСтатьи.Найти(Ссылка) <> Неопределено
		 И ВариантРаспределенияРасходов <> Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности Тогда
			ТекстСообщения = НСтр("ru='Необходимо выбрать вариант распределения ""На направления деятельности""';uk='Необхідно вибрати варіант розподілу ""На напрями діяльності""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ВариантРаспределенияРасходов",
				,
				Отказ);
		КонецЕсли;
			
	КонецЕсли;
	
	//++ НЕ УТ
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВариантРаспределенияРасходов <> Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПравилоРаспределенияПоЭтапамПроизводства");
		МассивНепроверяемыхРеквизитов.Добавить("ПравилоРаспределенияПоПодразделениям");
	КонецЕсли;
	Если ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты Тогда
		Если СпособРаспределенияНаПроизводственныеЗатраты <> Перечисления.СпособыРаспределенияСтатейРасходов.ПоПодразделениямИЭтапамПоПравилам Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПравилоРаспределенияПоПодразделениям");
		КонецЕсли;
		Если СпособРаспределенияНаПроизводственныеЗатраты = Перечисления.СпособыРаспределенияСтатейРасходов.ПоЭтапамВручнуюПоВсемПодразделениям
			ИЛИ СпособРаспределенияНаПроизводственныеЗатраты = Перечисления.СпособыРаспределенияСтатейРасходов.НаДругиеСтатьиРасходов Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПравилоРаспределенияПоЭтапамПроизводства");
		КонецЕсли;
	КонецЕсли;
	Если ВариантРаспределенияРасходов <> Перечисления.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидАктива");
	КонецЕсли;
	
	
	Если ВариантРаспределенияРасходов <> Перечисления.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов Тогда  	 
		МассивНепроверяемыхРеквизитов.Добавить("ВидРБП"); 
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	//-- НЕ УТ
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если ВариантРаспределенияРасходов <> Перечисления.ВариантыРаспределенияРасходов.НаНаправленияДеятельности Тогда
			Если ВариантРаспределенияРасходов <> Перечисления.ВариантыРаспределенияРасходов.НаПрочиеАктивы Тогда
				КорреспондирующийСчет = "";
			КонецЕсли;
		КонецЕсли;
		
		Если ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров Тогда
			ВидЦенности = Перечисления.ВидыЦенностей.Товары;
		//++ НЕ УТ
		ИначеЕсли ВариантРаспределенияРасходов = Перечисления.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы Тогда
			Если ВидЦенности.Пустая() Тогда
				ВидЦенности = Перечисления.ВидыЦенностей.ОС
			КонецЕсли;
			
			Если ВидЦенности = Перечисления.ВидыЦенностей.ОС
			 Или ВидЦенности = Перечисления.ВидыЦенностей.ОбъектыНезавершенногоСтроительства Тогда
				ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОбъектыЭксплуатации");
			ИначеЕсли ВидЦенности = Перечисления.ВидыЦенностей.НМА Тогда
				ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.НематериальныеАктивы");
			КонецЕсли;
		//-- НЕ УТ
		Иначе
			ВидЦенности = Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
		КонецЕсли;
		
		ПрочиеРасходы = ТипЗначения.СодержитТип(Тип("СправочникСсылка.ПрочиеРасходы"));
		ДоговорыКредитовИДепозитов = ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
		//++ НЕ УТ
		РасходыНаОбъектыЭксплуатации = (ТипЗначения.СодержитТип(Тип("СправочникСсылка.ОбъектыЭксплуатации")));
		РасходыНаНМАиНИОКР = (ТипЗначения.СодержитТип(Тип("СправочникСсылка.НематериальныеАктивы")));
		//-- НЕ УТ
		
		Если Не ПустаяСтрока(КорреспондирующийСчет) Тогда
			Если ПустаяСтрока(СтрЗаменить(КорреспондирующийСчет, ".", "")) Тогда
				КорреспондирующийСчет = "";
			Иначе
				Пока Прав(СокрЛП(КорреспондирующийСчет), 1) = "." Цикл
					КорреспондирующийСчет = Лев(СокрЛП(КорреспондирующийСчет), СтрДлина(СокрЛП(КорреспондирующийСчет)) - 1);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ОграничитьИспользование
			И ДоступныеХозяйственныеОперации.Количество() > 0 Тогда
			
			ДоступныеХозяйственныеОперации.Очистить();
			ДоступныеОперации = "";
		Иначе
			СписокОпераций = Новый СписокЗначений;
			ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьСписокХозяйственныхОпераций(СписокОпераций);
			СтрокаДоступныеОперации = "";
			Для Каждого СтрокаТаблицы Из ДоступныеХозяйственныеОперации Цикл
				ЭлементСписка = СписокОпераций.НайтиПоЗначению(СтрокаТаблицы.ХозяйственнаяОперация);
				Если ЭлементСписка <> Неопределено Тогда
					СтрокаДоступныеОперации = СтрокаДоступныеОперации
						+ ?(Не ПустаяСтрока(СтрокаДоступныеОперации), ", ", "")
						+ ЭлементСписка.Представление;
				КонецЕсли;
			КонецЦикла;
			Если ДоступныеОперации <> СтрокаДоступныеОперации Тогда
				ДоступныеОперации = СтрокаДоступныеОперации;
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
